In [20]:
import pandas as pd
import re

for movie_titles csv file

In [14]:
rows = []
with open(f'dataset/movie_titles.csv', 'r') as file:
    for line in file:
        line_items = [item.strip() for item in line.split(",")]
        
        if len(line_items) > 3:
            row = line_items[:2] + [", ".join(line_items[2:])]
        else:
            row = line_items
        rows.append(row)
df = pd.DataFrame(rows, columns=['movie_id', 'year_of_release', 'title'])

In [17]:
df.describe()

       movie_id year_of_release                        title
count     17770           17770                        17770
unique    17770              95                        17359
top           1            2004  The Hunchback of Notre Dame
freq          1            1436                            6

In [18]:
df.head()

  movie_id year_of_release                         title
0        1            2003               Dinosaur Planet
1        2            2004    Isle of Man TT 2004 Review
2        3            1997                     Character
3        4            1994  Paula Abdul's Get Up & Dance
4        5            2004      The Rise and Fall of ECW

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17770 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         17770 non-null  object
 1   year_of_release  17770 non-null  object
 2   title            17770 non-null  object
dtypes: object(3)
memory usage: 416.6+ KB

In [23]:
df[df["year_of_release"] == "NULL"]

      movie_id year_of_release                                        title
4387      4388            NULL      Ancient Civilizations: Rome and Pompeii
4793      4794            NULL  Ancient Civilizations: Land of the Pharaohs
7240      7241            NULL     Ancient Civilizations: Athens and Greece
10781    10782            NULL                       Roti Kapada Aur Makaan
15917    15918            NULL                      Hote Hote Pyaar Ho Gaya
16677    16678            NULL                              Jimmy Hollywood
17666    17667            NULL                           Eros Dance Dhamaka

In [24]:
df[df["title"].isna()]

Empty DataFrame
Columns: [movie_id, year_of_release, title]
Index: []

In [25]:
# cleaning rows with null
df = df[df["year_of_release"] != "NULL"]

In [27]:
df.shape

(17763, 3)

In [29]:
df["movie_id"] = df["movie_id"].astype(int)
df["year_of_release"] = df["year_of_release"].astype(int)
df["title"] = df["title"].astype(str)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17763 entries, 0 to 17769
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         17763 non-null  int64
 1   year_of_release  17763 non-null  int64
 2   title            17763 non-null  object
dtypes: int64(2), object(1)
memory usage: 555.1+ KB

In [39]:
df.to_parquet("dataset/movie_titles.parquet", engine="fastparquet", index=False)

In [40]:
# double checking that we re all right
df = pd.read_parquet("dataset/movie_titles.parquet", engine="fastparquet")
df.head()

   movie_id  year_of_release                         title
0         1             2003               Dinosaur Planet
1         2             2004    Isle of Man TT 2004 Review
2         3             1997                     Character
3         4             1994  Paula Abdul's Get Up & Dance
4         5             2004      The Rise and Fall of ECW

for the combined data txt files

In [4]:
rows = []
for i in range(1,5):
    with open(f'dataset/combined_data_{i}.txt', 'r') as file:
        for line in file:
            line = line.strip()
            match = re.match(r"^(\d+):$", line)
            if match:
                movie_id = match.group(1)
            else:
                customer_id, rating, date = line.split(',')
                row = (movie_id, customer_id, rating, date)
                rows.append(row)

df = pd.DataFrame(rows, columns=['movie_id', 'customer_id', 'rating', 'date'])

In [5]:
df.head()

  movie_id customer_id rating        date
0        1     1488844      3  2005-09-06
1        1      822109      5  2005-05-13
2        1      885013      4  2005-10-19
3        1       30878      4  2005-12-26
4        1      823519      3  2004-05-03

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 4 columns):
 #   Column       Dtype
---  ------       -----
 0   movie_id     object
 1   customer_id  object
 2   rating       object
 3   date         object
dtypes: object(4)
memory usage: 3.0+ GB

In [8]:
df.isna().sum()

movie_id       0
customer_id    0
rating         0
date           0
dtype: int64

In [9]:
df.isnull().sum()

movie_id       0
customer_id    0
rating         0
date           0
dtype: int64

In [10]:
df["movie_id"] = pd.to_numeric(df["movie_id"], errors="coerce")
df["customer_id"] = pd.to_numeric(df["customer_id"], errors="coerce")
df["rating"] = pd.to_numeric(df["rating"], errors="coerce")
df["date"] = pd.to_datetime(df["date"], errors="coerce")

In [11]:
(df == "").sum()

movie_id       0
customer_id    0
rating         0
date           0
dtype: int64

In [13]:
df.shape

(100480507, 4)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100480507 entries, 0 to 100480506
Data columns (total 4 columns):
 #   Column       Dtype
---  ------       -----
 0   movie_id     int64
 1   customer_id  int64
 2   rating       int64
 3   date         datetime64[ns]
dtypes: datetime64[ns](1), int64(3)
memory usage: 3.0 GB

In [17]:
df.to_parquet("dataset/data.parquet", engine="fastparquet", index=False)